research/reading.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-01 Sat 12:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Research</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Henry Robinson" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Research</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgecb0fe6">1. Blog topics</a>
<ul>
<li><a href="#orgb93cdac">1.1. Consensus-in-the-datacenter</a></li>
<li><a href="#orgb7f2dd2">1.2. Chain replication</a></li>
<li><a href="#org165b1ca">1.3. ML processing frameworks</a></li>
<li><a href="#org29a5788">1.4. Actors</a></li>
<li><a href="#org10bbf86">1.5. Causal consistency</a></li>
<li><a href="#org6e6b26e">1.6. Consensus</a></li>
<li><a href="#org8f90e13">1.7. Stream processing</a></li>
</ul>
</li>
<li><a href="#org0cac1a5">2. Topics and links</a>
<ul>
<li><a href="#org7e2be94">2.1. TLA</a></li>
<li><a href="#org375f23b">2.2. Azure</a></li>
<li><a href="#org184467a">2.3. CPU blog</a></li>
<li><a href="#org5ce3bd7">2.4. Chandy-Lamport</a></li>
<li><a href="#org7aad187">2.5. Corfu et. al.</a></li>
<li><a href="#org0b4d0c2">2.6. Distributed control systems</a></li>
</ul>
</li>
<li><a href="#orga9622a4">3. Courses</a>
<ul>
<li><a href="#orgeaaa98c">3.1. MIT dist systems readings</a></li>
<li><a href="#org76fd671">3.2. MIT perf engineering</a></li>
<li><a href="#orgf9e0136">3.3. Berkeley great ideas in computer architecture:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgecb0fe6" class="outline-2">
<h2 id="orgecb0fe6"><span class="section-number-2">1</span> Blog topics</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb93cdac" class="outline-3">
<h3 id="orgb93cdac"><span class="section-number-3">1.1</span> Consensus-in-the-datacenter</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>NOPaxos (OSDI 2016)</li>
<li>NSDI 2018 paper</li>
<li>Eris (SOSP 2017)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb7f2dd2" class="outline-3">
<h3 id="orgb7f2dd2"><span class="section-number-3">1.2</span> Chain replication</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>2004 paper</li>
<li>CRAQ</li>
<li>HDFS</li>
<li>NSDI 2018 paper</li>
<li>Hyperdex (?)</li>
</ul>
</div>
</div>
<div id="outline-container-org165b1ca" class="outline-3">
<h3 id="org165b1ca"><span class="section-number-3">1.3</span> ML processing frameworks</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Tensorflow</li>
<li>Ray</li>
</ul>
</div>
</div>
<div id="outline-container-org29a5788" class="outline-3">
<h3 id="org29a5788"><span class="section-number-3">1.4</span> Actors</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Orleans</li>
<li>Ray</li>
</ul>
</div>
</div>
<div id="outline-container-org10bbf86" class="outline-3">
<h3 id="org10bbf86"><span class="section-number-3">1.5</span> Causal consistency</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Megastore</li>
<li>Don't settle for eventual: scalable causal consistency for wide-area storage with COPS</li>
<li>Bolt-on cauasal consistency</li>
<li>MDCC: multi-data center consistency</li>
</ul>
</div>
</div>
<div id="outline-container-org6e6b26e" class="outline-3">
<h3 id="org6e6b26e"><span class="section-number-3">1.6</span> Consensus</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Paxos
<ul class="org-ul">
<li>and variants: fast paxos, vertical paxos</li>
</ul></li>
<li>Egalitarian Paxos</li>
<li>Flexible Paxos</li>
<li>NOPaxos</li>
<li>Two-level wide-area protocols (2PC + Paxos)
<ul class="org-ul">
<li>Spanner</li>
<li>Consistent transactions w/inconsistent state</li>
</ul></li>
<li>Heidi Howard's work</li>
</ul>
</div>
</div>
<div id="outline-container-org8f90e13" class="outline-3">
<h3 id="org8f90e13"><span class="section-number-3">1.7</span> Stream processing</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Discretized streams (SOSP 2013)</li>
<li>Structured streaming (SIGMOD 2018)</li>
<li>StreamBox (ATC 2017)</li>
<li>Drizzle (SOSP 2017)</li>
<li>Differential Dataflow (CIDR 2015)</li>
<li>Flink
<ul class="org-ul">
<li>Lightweight async snapshots</li>
<li>Stream and batch processing single engine</li>
<li>State mgmt in Apache Flink</li>
</ul></li>
<li>The Dataflow Model (Google, VLDB 2015)</li>
<li>Streamscope (NSDI 2016)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org0cac1a5" class="outline-2">
<h2 id="org0cac1a5"><span class="section-number-2">2</span> Topics and links</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7e2be94" class="outline-3">
<h3 id="org7e2be94"><span class="section-number-3">2.1</span> TLA</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>learntla.com</li>
<li><a href="https://pron.github.io/posts/tlaplus_part1">https://pron.github.io/posts/tlaplus_part1</a></li>
</ul>
</div>
</div>

<div id="outline-container-org375f23b" class="outline-3">
<h3 id="org375f23b"><span class="section-number-3">2.2</span> Azure</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Service fabric</li>
<li>ADLS</li>
</ul>
</div>
</div>

<div id="outline-container-org184467a" class="outline-3">
<h3 id="org184467a"><span class="section-number-3">2.3</span> CPU blog</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://dendibakh.github.io/notes/">https://dendibakh.github.io/notes/</a>
</p>
</div>
</div>
<div id="outline-container-org5ce3bd7" class="outline-3">
<h3 id="org5ce3bd7"><span class="section-number-3">2.4</span> Chandy-Lamport</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://en.wikipedia.org/wiki/Chandy-Lamport_algorithm">https://en.wikipedia.org/wiki/Chandy-Lamport_algorithm</a>
</p>
</div>
</div>
<div id="outline-container-org7aad187" class="outline-3">
<h3 id="org7aad187"><span class="section-number-3">2.5</span> Corfu et. al.</h3>
</div>
<div id="outline-container-org0b4d0c2" class="outline-3">
<h3 id="org0b4d0c2"><span class="section-number-3">2.6</span> Distributed control systems</h3>
</div>
</div>
<div id="outline-container-orga9622a4" class="outline-2">
<h2 id="orga9622a4"><span class="section-number-2">3</span> Courses</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgeaaa98c" class="outline-3">
<h3 id="orgeaaa98c"><span class="section-number-3">3.1</span> MIT dist systems readings</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="http://nil.csail.mit.edu/6.824/2017/schedule.html">http://nil.csail.mit.edu/6.824/2017/schedule.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org76fd671" class="outline-3">
<h3 id="org76fd671"><span class="section-number-3">3.2</span> MIT perf engineering</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-172-performance-engineering-of-software-systems-fall-2010/video-lectures/">https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-172-performance-engineering-of-software-systems-fall-2010/video-lectures/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf9e0136" class="outline-3">
<h3 id="orgf9e0136"><span class="section-number-3">3.3</span> Berkeley great ideas in computer architecture:</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<a href="http://inst.eecs.berkeley.edu/~cs61c/fa18/">http://inst.eecs.berkeley.edu/~cs61c/fa18/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Henry Robinson</p>
<p class="date">Created: 2019-06-01 Sat 12:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
